<a href="https://colab.research.google.com/github/InTaewoo/Visualization/blob/master/%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B6%84%EC%84%9D_%EC%97%B0%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [21]:
df = pd.read_csv('/content/missing_data_test.csv',encoding='cp949',index_col='연도')
df

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0
2019    NaN  250  140.0    NaN

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 2015 to 2019
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   제품1     4 non-null      float64
 1   제품2     5 non-null      int64
 2   제품3     4 non-null      float64
 3   제품4     2 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 200.0 bytes

In [17]:
df.describe()

                연도         제품1         제품2         제품3         제품4
count     5.000000    4.000000    5.000000    4.000000    2.000000
mean   2017.000000  180.000000  198.000000  135.000000  160.000000
std       1.581139   57.154761   43.243497   28.867513   14.142136
min    2015.000000  120.000000  150.000000  100.000000  150.000000
25%    2016.000000  142.500000  160.000000  122.500000  155.000000
50%    2017.000000  175.000000  200.000000  135.000000  160.000000
75%    2018.000000  212.500000  230.000000  147.500000  165.000000
max    2019.000000  250.000000  250.000000  170.000000  170.000000

In [18]:
df.isnull()

      연도    제품1    제품2    제품3    제품4
0  False  False  False   True   True
1  False  False  False  False   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True  False  False   True

In [19]:
df.isnull().sum()

연도     0
제품1    1
제품2    0
제품3    1
제품4    3
dtype: int64

In [25]:
#결측치 제거
df.drop(index=[2019])

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [26]:
df.drop(columns=['제품3','제품4'])

        제품1  제품2
연도
2015  250.0  150
2016  200.0  160
2017  150.0  200
2018  120.0  230
2019    NaN  250

In [27]:
df.drop(index=[2019],columns=['제품3','제품4'])

        제품1  제품2
연도
2015  250.0  150
2016  200.0  160
2017  150.0  200
2018  120.0  230

In [28]:
df.dropna()

        제품1  제품2    제품3    제품4
연도
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [30]:
df.dropna(axis=0,subset=['제품1'])

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [31]:
df.dropna(axis=1)

      제품2
연도
2015  150
2016  160
2017  200
2018  230
2019  250

In [34]:
df.fillna(0)

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    0.0    0.0
2016  200.0  160  170.0    0.0
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0
2019    0.0  250  140.0    0.0

In [35]:
df.fillna(method='bfill')

        제품1  제품2    제품3    제품4
연도
2015  250.0  150  170.0  150.0
2016  200.0  160  170.0  150.0
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0
2019    NaN  250  140.0    NaN

In [37]:
df

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0
2019    NaN  250  140.0    NaN

In [39]:
values = {'제품1':100,'제품4':400}
df.fillna(value=values)

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN  400.0
2016  200.0  160  170.0  400.0
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0
2019  100.0  250  140.0  400.0

In [44]:
df_sales = pd.read_csv('total_sales_data.csv')
df_sales

  매장명  제품종류 모델명  판매  재고
0   A  스마트폰  S1   1   2
1   A  스마트폰  S2   2   5
2   A    TV  V1   3   5
3   B  스마트폰  S2   4   6
4   B  스마트폰  S1   5   8
5   B    TV  V1   6   9
6   C  스마트폰  S2   2   4
7   C    TV  V1   3   6
8   C    TV  V2   7   9

In [45]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   매장명     9 non-null      object
 1   제품종류    9 non-null      object
 2   모델명     9 non-null      object
 3   판매      9 non-null      int64
 4   재고      9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 488.0+ bytes

In [47]:
# 중복제거
df_sales['매장명'].value_counts()

C    3
A    3
B    3
Name: 매장명, dtype: int64

In [49]:
df_sales['매장명'].unique()

array(['A', 'B', 'C'], dtype=object)

In [51]:
df_sales['제품종류'].value_counts()

스마트폰    5
TV      4
Name: 제품종류, dtype: int64

In [53]:
df_sales.pivot_table(index=['매장명','제품종류','모델명'], values=['판매','재고'])

              재고  판매
매장명 제품종류 모델명
A   TV   V1    5   3
    스마트폰 S1    2   1
         S2    5   2
B   TV   V1    9   6
    스마트폰 S1    8   5
         S2    6   4
C   TV   V1    6   3
         V2    9   7
    스마트폰 S2    4   2